Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолнНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Псевдоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>900</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаНакладных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьДублиСерий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПривязыватьИнвойсы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссионногоВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/StockAPI_Контрагенты/Ext/Module.bsl
// ─── Поиск контрагента ───────────────────────────────────────────────────────

// Поиск контрагента по коду или наименованию  
//
Функция НайтиКонтрагента(ДанныеЗапроса, УчетнаяЗапись, Ошибка) Экспорт
	
	Администратор = StockAPI_Утилиты.ЭтоАдминистраторAPI(УчетнаяЗапись);
	ГруппаКонтрагентов = УчетнаяЗапись.ГруппаКонтрагентов;
	Если НЕ Администратор И НЕ ЗначениеЗаполнено(ГруппаКонтрагентов) Тогда
		Ошибка = "В 1С не указана группа контрагентов учетной записи интеграции.";
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	КодПоиска = "";
	ШаблонПоиска = ""; 
	
	КодПоиска = StockAPI_Утилиты.СвойствоДанныхЗапроса(ДанныеЗапроса, "counterpartyCode,customerCode,code");	
	Если КодПоиска <> "" Тогда 
		Попытка
			КодПоиска = Число(КодПоиска);
		Исключение
		    Ошибка = СтрШаблон("Значение кода контрагента не числовое: '%1'.", КодПоиска);
			Возврат Справочники.Контрагенты.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
	ШаблонПоиска = StockAPI_Утилиты.СвойствоДанныхЗапроса(ДанныеЗапроса, "counterparty,customer,name");	
	Если КодПоиска = "" И ШаблонПоиска = "" Тогда
		Ошибка = "В запросе нет кода и/или наименования контрагента (counterpartyCode или customerCode или code, counterparty или customer или name).";
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли; 
	
    Запр = Новый Запрос;  
	Запр.УстановитьПараметр("Код", КодПоиска);
	Запр.УстановитьПараметр("Наименование", ШаблонПоиска);
	Запр.Текст = "ВЫБРАТЬ
	             |	Контрагенты.Ссылка КАК Контрагент
	             |ИЗ
	             |	Справочник.Контрагенты КАК Контрагенты
	             |ГДЕ
	             |	НЕ Контрагенты.ПометкаУдаления
	             |	И НЕ Контрагенты.ЭтоГруппа
	             |	И ВЫБОР
	             |			КОГДА &Код = """"
	             |				ТОГДА ИСТИНА
	             |			ИНАЧЕ Контрагенты.Код = &Код
	             |		КОНЕЦ
	             |	И ВЫБОР
	             |			КОГДА &Наименование = """"
	             |				ТОГДА ИСТИНА
	             |			ИНАЧЕ Контрагенты.Наименование = &Наименование
	             |		КОНЕЦ
	             |	И &УсловиеДоступа";
	Если Администратор Тогда
		Запр.Текст = СтрЗаменить(Запр.Текст, "&УсловиеДоступа", "Контрагенты.Ссылка В (&ОбщиеКонтрагенты)");
		Запр.УстановитьПараметр("ОбщиеКонтрагенты", StockAPI_Утилиты.КонтрагентыОбщиеДляВсехУчетныхЗаписейAPI());
	Иначе
		Запр.Текст = СтрЗаменить(Запр.Текст, "&УсловиеДоступа", "Контрагенты.Ссылка В ИЕРАРХИИ(&ГруппаКонтрагентов)");
		Запр.УстановитьПараметр("ГруппаКонтрагентов", ГруппаКонтрагентов);
	КонецЕсли;
	Выборка = Запр.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Контрагент;
	Иначе
		Ошибка = "Контрагент не найден.";
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// ─── Список контрагентов и CRUD ───────────────────────────────────────────── 

Функция НаименованиеКонтрагентаИзЗапроса(ДанныеЗапроса)
	
	Если ДанныеЗапроса.Свойство("counterparty") И СокрЛП(ДанныеЗапроса.counterparty) <> "" Тогда
		Возврат СокрЛП(ДанныеЗапроса.counterparty);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("name") И СокрЛП(ДанныеЗапроса.name) <> "" Тогда
		Возврат СокрЛП(ДанныеЗапроса.name);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("customer") И СокрЛП(ДанныеЗапроса.customer) <> "" Тогда
		Возврат СокрЛП(ДанныеЗапроса.customer);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция СтруктураКонтрагентаJSON(Стр)
	
	Элемент = Новый Структура;
	Элемент.Вставить("counterparty", 		Стр.Наименование);
	Элемент.Вставить("counterpartyCode", 	StockAPI_Утилиты.КодВСтроку(Стр.Код));
	Элемент.Вставить("email", 				Стр.email);
	Элемент.Вставить("phone",				Стр.Телефоны);
	Элемент.Вставить("city", 				Строка(Стр.Город));
	Элемент.Вставить("cityCode", 			StockAPI_Утилиты.КодВСтроку(Стр.ГородКод));
	Элемент.Вставить("address", 			Стр.Адрес);
	Элемент.Вставить("priceType", 			Строка(Стр.ВидЦены));
	Элемент.Вставить("currency", 			Строка(Стр.Валюта));
	Возврат Элемент;
	
КонецФункции

// Возвращает страницу из таблицы значений по индексу строки.
//
// Параметры:
//  ТаблицаВсе     - ТаблицаЗначений - полный отсортированный результат;
//  Пропустить     - Число - смещение (0 для первой страницы);
//  РазмерСтраницы - Число - количество строк на странице.
//
// Возвращаемое значение:
//  ТаблицаЗначений - строки запрошенной страницы.
//
Функция СтраницаТаблицы(ТаблицаВсе, Пропустить, РазмерСтраницы)
	
	Результат = ТаблицаВсе.СкопироватьКолонки();
	Если РазмерСтраницы <= 0 Или ТаблицаВсе.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	НачИндекс = Пропустить;
	Если НачИндекс >= ТаблицаВсе.Количество() Тогда
		Возврат Результат;
	КонецЕсли;
	
	КонИндекс = Пропустить + РазмерСтраницы - 1;
	Если КонИндекс > ТаблицаВсе.Количество() - 1 Тогда
		КонИндекс = ТаблицаВсе.Количество() - 1;
	КонецЕсли;
	
	Для Индекс = НачИндекс По КонИндекс Цикл
		ЗаполнитьЗначенияСвойств(Результат.Добавить(), ТаблицаВсе[Индекс]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// GET /counterparties — список контрагентов с пагинацией.
// Группа — группа контрагентов учётной записи; для администратора передаётся пустая ссылка,
// список берётся как пересечение групп всех активных учётных записей.
//
Функция ПолучитьСписокКонтрагентов(Запрос, Группа) Экспорт
	
	Результат = Новый Структура("Тело, Ошибка", Неопределено, "");
	
	Пагинация = StockAPI_Утилиты.ПараметрыПагинацииОстатков(Запрос);
	Если Пагинация.Ошибка <> "" Тогда
		Результат.Ошибка = Пагинация.Ошибка;
		Возврат Результат;
	КонецЕсли;
	
	СтрокаПоиска = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "search");
	СтрокаКода = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "counterpartyCode,customerCode,code");
	Если ЗначениеЗаполнено(СтрокаКода) Тогда
		Попытка
		    ЧислоКода = Число(СтрокаКода);
		Исключение
			Результат.Ошибка = "Ошибка преобразования кода контрагента в число.";
			Возврат Результат;
		КонецПопытки;
	Иначе
		ЧислоКода = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Группа) Тогда
		ТаблицаВсе = ТаблицаКонтрагентов(СтрокаПоиска, ЧислоКода, Группа);
	ИначеЕсли Группа = Справочники.Контрагенты.ПустаяСсылка() Тогда
		// Режим администратора: пересечение по всем учётным записям.
		ТаблицаВсе = ТаблицаКонтрагентов(СтрокаПоиска, ЧислоКода, , StockAPI_Утилиты.КонтрагентыОбщиеДляВсехУчетныхЗаписейAPI());
	Иначе
		Результат.Ошибка = "В 1С не указана группа контрагентов в учетной записи интеграции.";
		Возврат Результат;
	КонецЕсли;
	
	ВсегоКонтрагентов = ТаблицаВсе.Количество();
	РазмерСтраницы = Пагинация.pageSize;
	ВсегоСтраниц = StockAPI_Утилиты.ВсегоСтраницПагинации(ВсегоКонтрагентов, РазмерСтраницы);
	Пропустить = (Пагинация.page - 1) * РазмерСтраницы;
	
	ТаблицаКонтрагентов = СтраницаТаблицы(ТаблицаВсе, Пропустить, РазмерСтраницы);
	
	Массив = Новый Массив;
	Для Каждого Стр Из ТаблицаКонтрагентов Цикл
		Массив.Добавить(СтруктураКонтрагентаJSON(Стр));
	КонецЦикла;
	
	ТелоОтвета = Новый Структура;
	ТелоОтвета.Вставить("page", 		Пагинация.page);
	ТелоОтвета.Вставить("pageSize", 	Пагинация.pageSize);
	ТелоОтвета.Вставить("totalItems", 	ВсегоКонтрагентов);
	ТелоОтвета.Вставить("totalPages", 	ВсегоСтраниц);
	ТелоОтвета.Вставить("items", 		Массив);
	Результат.Тело = ТелоОтвета;
	Возврат Результат;
	
КонецФункции

// POST /counterparties — создание контрагента в справочнике.
//
Функция СоздатьКонтрагента(ДанныеЗапроса, Группа) Экспорт
	
	Результат = Новый Структура("success, error, counterparty, counterpartyCode", Ложь, "", "", "");
	
	Если НЕ ЗначениеЗаполнено(Группа) Тогда
		Результат.error = "В 1С не указана группа контрагентов в учетной записи интеграции.";
		Возврат Результат;
	КонецЕсли;

	Наименование = НаименованиеКонтрагентаИзЗапроса(ДанныеЗапроса);
	Если Наименование = "" Тогда
		Результат.error = "Укажите наименование контрагента (counterparty, name или customer).";
		Возврат Результат;
	КонецЕсли;
	
	Существующий = Справочники.Контрагенты.НайтиПоНаименованию(Наименование, Истина, Группа);
	Если ЗначениеЗаполнено(Существующий) Тогда
		Результат.error = СтрШаблон("Контрагент '%1' уже существует (код %2).",
									Наименование,
									StockAPI_Утилиты.КодВСтроку(Существующий.Код));
		Возврат Результат;
	КонецЕсли;

	Объект = Справочники.Контрагенты.СоздатьЭлемент(); 
	Объект.УстановитьНовыйКод();
	Объект.Наименование = Наименование; 
	Объект.Псевдоним = "API-" + StockAPI_Утилиты.КодВСтроку(Объект.Код);
	Объект.Родитель = Группа;
	
	Если ДанныеЗапроса.Свойство("email") Тогда
		Объект.Email = СокрЛП(ДанныеЗапроса.email);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("phone") Тогда
		Объект.Телефоны = СокрЛП(ДанныеЗапроса.phone);
	ИначеЕсли ДанныеЗапроса.Свойство("phones") Тогда
		Объект.Телефоны = СокрЛП(ДанныеЗапроса.phones);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("city") Тогда
		Объект.Город = Справочники.Города.НайтиПоНаименованию(СокрЛП(ДанныеЗапроса.city));
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("address") Тогда
		Объект.Адрес = СокрЛП(ДанныеЗапроса.address);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("note") Тогда
		Объект.Примечание = СокрЛП(ДанныеЗапроса.note);
	ИначеЕсли ДанныеЗапроса.Свойство("comment") Тогда
		Объект.Примечание = СокрЛП(ДанныеЗапроса.comment);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("priceType") Тогда
		Объект.ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию(ДанныеЗапроса.priceType, Истина);
	КонецЕсли;

	Попытка
		Объект.Записать();
	Исключение
		Результат.error = "Не удалось создать контрагента: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Результат;
	КонецПопытки;
	
	КодСтрокой = StockAPI_Утилиты.КодВСтроку(Объект.Код);
	
	Результат.success = Истина;
	Результат.counterparty = Объект.Наименование;
	Результат.counterpartyCode = КодСтрокой;
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокГородов(Запрос) Экспорт

	Результат = Новый Структура("Тело, Ошибка", Неопределено, "");
	
	Пагинация = StockAPI_Утилиты.ПараметрыПагинацииОстатков(Запрос);
	Если Пагинация.Ошибка <> "" Тогда
		Результат.Ошибка = Пагинация.Ошибка;
		Возврат Результат;
	КонецЕсли;
	
	СтрокаПоиска = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "search");
	СтрокаКода = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "cityCode");
	Если СтрокаКода = "" Тогда
		СтрокаКода = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "code");
	КонецЕсли;
	
	ТаблицаВсе = ТаблицаГородов(СтрокаПоиска, СтрокаКода);
	ВсегоГородов = ТаблицаВсе.Количество();
	РазмерСтраницы = Пагинация.pageSize;
	ВсегоСтраниц = StockAPI_Утилиты.ВсегоСтраницПагинации(ВсегоГородов, РазмерСтраницы);
	Пропустить = (Пагинация.page - 1) * РазмерСтраницы;
	
	ТаблицаСтраницы = СтраницаТаблицы(ТаблицаВсе, Пропустить, РазмерСтраницы);
	
	МассивСтрок = Новый Массив;
	Для Каждого Стр Из ТаблицаСтраницы Цикл
		Элемент = Новый Структура;
		Элемент.Вставить("city", 		Стр.Город);
		Элемент.Вставить("cityCode", 	Формат(Стр.ГородКод, "ЧГ="));
		Элемент.Вставить("country",		Строка(Стр.Страна));
		Элемент.Вставить("countryCode",	Формат(Стр.СтранаКод, "ЧГ="));
		МассивСтрок.Добавить(Элемент);
	КонецЦикла;
	
	ТелоОтвета = Новый Структура;
	ТелоОтвета.Вставить("page", 		Пагинация.page);
	ТелоОтвета.Вставить("pageSize", 	РазмерСтраницы);
	ТелоОтвета.Вставить("totalItems", 	ВсегоГородов);
	ТелоОтвета.Вставить("totalPages", 	ВсегоСтраниц);
	ТелоОтвета.Вставить("items", 		МассивСтрок);
	
	Возврат Новый Структура("КодОтвета, Тело, Ошибка", 200, ТелоОтвета, "");
		

КонецФункции // ПолучитьСписокГородов()

Функция ТаблицаГородов(СтрокаПоиска, СтрокаКода)
	
	ШаблонПоиска 	= ?(ЗначениеЗаполнено(СтрокаПоиска), "%" + СтрокаПоиска + "%", "");
	КодЧисло 		= ?(ЗначениеЗаполнено(СтрокаКода), Число(СтрокаКода), Неопределено);
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	Города.Код КАК ГородКод,
	             |	Города.Наименование КАК Город,
	             |	Города.Страна.Наименование КАК Страна,
	             |	Города.Страна.Код КАК СтранаКод
	             |ИЗ
	             |	Справочник.Города КАК Города
	             |ГДЕ
	             |	НЕ Города.ПометкаУдаления
	             |	И ВЫБОР
	             |			КОГДА &Код = НЕОПРЕДЕЛЕНО
	             |				ТОГДА ИСТИНА
	             |			ИНАЧЕ Города.Код = &Код
	             |		КОНЕЦ
	             |	И ВЫБОР
	             |			КОГДА &ШаблонПоиска = """"
	             |				ТОГДА ИСТИНА
	             |			ИНАЧЕ Города.Наименование ПОДОБНО &ШаблонПоиска
	             |		КОНЕЦ
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Города.Страна.Наименование,
	             |	Города.Наименование";
	Запр.УстановитьПараметр("ШаблонПоиска", 	ШаблонПоиска);
	Запр.УстановитьПараметр("Код", 			КодЧисло);
	
	Возврат Запр.Выполнить().Выгрузить();
	
КонецФункции

Функция ТаблицаКонтрагентов(СтрокаПоиска, КодЧисло, Группа = Неопределено, СписокКонтрагентов = Неопределено)

	ШаблонПоиска = ?(ЗначениеЗаполнено(СтрокаПоиска), "%" + СтрокаПоиска + "%", ""); 
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	Конт.Ссылка КАК Ссылка,
	            |	Конт.Код КАК Код,
	            |	Конт.Наименование КАК Наименование,
	            |	Конт.Email КАК email,
	            |	Конт.Телефоны КАК Телефоны,
	            |	Конт.Город.Наименование КАК Город,
	            |	Конт.Город.Код КАК ГородКод,
	            |	Конт.Адрес КАК Адрес,
	            |	Конт.ВидЦены.Наименование КАК ВидЦены,
	            |	Конт.ВидЦены.Валюта.Наименование КАК Валюта
	            |ИЗ
	            |	Справочник.Контрагенты КАК Конт
	            |ГДЕ
	            |	НЕ Конт.ЭтоГруппа
	            |	И НЕ Конт.ПометкаУдаления
	            |	И &УсловиеДоступа
	            |	И ВЫБОР
	            |			КОГДА &Код = НЕОПРЕДЕЛЕНО
	            |				ТОГДА ИСТИНА
	            |			ИНАЧЕ Конт.Код = &Код
	            |		КОНЕЦ
	            |	И ВЫБОР
	            |			КОГДА &ШаблонПоиска = """"
	            |				ТОГДА ИСТИНА
	            |			ИНАЧЕ Конт.Наименование ПОДОБНО &ШаблонПоиска
	            |		КОНЕЦ
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	Конт.Наименование,
	            |	Конт.Код";
	Если СписокКонтрагентов <> Неопределено Тогда
		Зап.Текст = СтрЗаменить(Зап.Текст, "&УсловиеДоступа", "Конт.Ссылка В (&СписокКонтрагентов)");
		Зап.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	ИначеЕсли ЗначениеЗаполнено(Группа) Тогда
		Зап.Текст = СтрЗаменить(Зап.Текст, "&УсловиеДоступа", "Конт.Ссылка В ИЕРАРХИИ(&Группа)");
		Зап.УстановитьПараметр("Группа", Группа);
	Иначе
		Зап.Текст = СтрЗаменить(Зап.Текст, "И &УсловиеДоступа", "");
	КонецЕсли;
	Зап.УстановитьПараметр("ШаблонПоиска", 	ШаблонПоиска);
	Зап.УстановитьПараметр("Код", 			КодЧисло);
	
	Возврат Зап.Выполнить().Выгрузить();

КонецФункции
